# num1, num2 = map(int, input().split()) # 스페이스바를 기준으로 숫자 2개를 나눠서 저장하는 것


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# s1 = input()
# s2 = input()

# if(len(s1) < len(s2)):      # len(변수 or 값), 변수 or 값의 길이를 숫자의 형태로 리턴함
#     print(s2)
# if(len(s1) > len(s2)):
#     print(s1)


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# row, col = map(int, input().split())

# for i in range(1, row+1, 1):        # 1을 더해서 row+1 인 것이다
#     for j in range(1, col+1, 1):    
#         print(i*j, end=' ')         # 스페이스 바 띄어주기
#     print()


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# n = int(input())

# for i in range (0,n,1):
#     for j in range (0,n,1):
#         print('* ')   


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 10개의 문자를 리스트에 저장(초기화)하고, 차례대로 출력하는 프로그램을 작성해보세요
# list1 = ['a','b','c','d','e','f','g','h','i','j']

# for i in list1:          
#     print(i, end=' ')
# print()


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 26개의 문자 리스트를 선언하고 'A'부터 'Z'까지 차례대로 저장한 후, 거꾸로 출력하는 프로그램을 만들어보세요.
list1 = ['A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','X','Y','Z']


