# num1, num2 = map(int, input().split()) # 스페이스바를 기준으로 숫자 2개를 나눠서 저장하는 것


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# s1 = input()
# s2 = input()

# if(len(s1) < len(s2)):      # len(변수 or 값), 변수 or 값의 길이를 숫자의 형태로 리턴함
#     print(s2)
# if(len(s1) > len(s2)):
#     print(s1)


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# row, col = map(int, input().split())

# for i in range(1, row+1, 1):        # 1을 더해서 row+1 인 것이다
#     for j in range(1, col+1, 1):    
#         print(i*j, end=' ')         # 스페이스 바 띄어주기
#     print()


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


n = int(input())

for i in range (0,n,1):
    for j in range (0,n,1):
        print('* ')   