# 비교 연산자
# 비교 연산의 결과는 무조건 True 또는 False로 나옴
# ==    : 같으면 True, 다르면 False
# !=    : 다르면 True, 같으면 False
# <
# >
# <=
# >=

# print(5 != 2)
# print(5 < 2)


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 조건식 종류

# [가장 일반적인 형식]
# if(조건식) : 
#       if의 조건식이 True일 경우 실행할 코드
# elif(조건식):
#       위의 조건식들이 False이고 elif의 조건식이 True일 경우 실행할 코드
# else :
#       위의 모든 조건식이 False일 경우 실행할 코드  


# [if만 사용한 경우]
# if(조건식) : 
#   if의 조건식이 true 일 경우 실행할 코드


# {if랑 elif만 사용한 경우}
# if(조건식) : 
#   if의 조건식이 true 일 경우 실행할 코드
# elif(조건식):
#       위의 조건식들이 False이고 elif의 조건식이 True일 경우 실행할 코드


# {if랑 else만 사용하는 경우}
# if(조건식) : 
#       if의 조건식이 True일 경우 실행할 코드
# else :
#       위의 모든 조건식이 False일 경우 실행할 코드  


# 위 형식들의 조건식이 있으며
# if는 무조건 1개,
# elif는 0개 부터 무한대
# else는 0개또는 1개를 사용하여 조건문을 구성할 수 있음
# 조건문은 조건문안에 중첩해 사용할 수 있다.


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #
