# for문
# for 변수 in range(start, end, step)
#   반복할 코드
# 위 형식이 반복문의 기본 형태이며, 중첩이 가능함

# range(start, end, step) 여기서 start, end, step은 정수(ex. range(1, 5, 2))
# start부터 end까지(end는 포함 안됨) step 만큼 증가/감소된 값을 변수에 넣고 반복
# start랑 step는 생략 가능.
# start를 생략하면 0
# step를 생략하면 1
# range(5)          => start와 step둘다 생략된 상태
# range(0, 5)       => step가 생략된 상태
# range(0, 5, 1)    => 완전한 상태
# 위 세가지 모형만 있음

# for i in range(0, 5, 1):    # i변수에 범위(0,1,2,3,4)를 넣으면서 반복. 총 5번 반복
#     print(i)                # 반복할 코드에 변수 사용

# for i in range(0, 5,1):
#     print("hello")          # 반복할 코드에 변수 사용x


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 1부터 100까지 홀수만을 출력
# for i in range(1, 100, 2):
#     print(i)


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 5부터 100까지 5의 배수를 출력
# for i in range(5, 101,5):
#     print(i)


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 10000까지의 제곱수를 출력
# for i in range(1,101,1):
#     print(i*i)


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 1부터 100까지 분수를 출력
# for i in range(1, 101,1):
#     print(1/i)


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# while문
# while(조건식):
#       코드
# 위 형식으로 사용
# if문과 비슷하게 조건식이 true일 경우 실행됨

# i = 0
# while(i<5):
#     print(i)
#     i +=  1  # i = i +1 이랑 같다는 뜻, 누적 덧셈


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 1부터 100까지 7의 배수를 출력
# i = 0
# while(i<100):
#     print(i)
#     i += 7


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #
